
## Plan Result (mng)

[CI link](https://github.com/Fumi-Mura/infra_portfolio/actions/runs/12516581587)


<pre><code>Plan: 13 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.identity_center.aws_identitystore_group.this[&#34;Admin&#34;]
  * module.identity_center.aws_identitystore_group.this[&#34;ReadOnly&#34;]
  * module.identity_center.aws_identitystore_group_membership.this[&#34;Admin&#34;]
  * module.identity_center.aws_identitystore_group_membership.this[&#34;ReadOnly&#34;]
  * module.identity_center.aws_identitystore_user.this[&#34;Admin&#34;]
  * module.identity_center.aws_identitystore_user.this[&#34;ReadOnly&#34;]
  * module.identity_center.aws_ssoadmin_account_assignment.this
  * module.identity_center.aws_ssoadmin_managed_policy_attachment.main[&#34;AdministratorAccess&#34;]
  * module.identity_center.aws_ssoadmin_managed_policy_attachment.main[&#34;ReadOnlyAccess&#34;]
  * module.identity_center.aws_ssoadmin_permission_set.this[&#34;AdministratorAccess&#34;]
  * module.identity_center.aws_ssoadmin_permission_set.this[&#34;ReadOnlyAccess&#34;]
  * module.organizations.aws_organizations_account.accounts[&#34;dev&#34;]
  * module.organizations.aws_organizations_account.accounts[&#34;prd&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.identity_center.aws_identitystore_group.this["Admin"] will be created
  + resource "aws_identitystore_group" "this" {
      + display_name      = "mng-fumis-portfolio-Admin-iam-identity-center-group"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9567439836"
    }

  # module.identity_center.aws_identitystore_group.this["ReadOnly"] will be created
  + resource "aws_identitystore_group" "this" {
      + display_name      = "mng-fumis-portfolio-ReadOnly-iam-identity-center-group"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9567439836"
    }

  # module.identity_center.aws_identitystore_group_membership.this["Admin"] will be created
  + resource "aws_identitystore_group_membership" "this" {
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9567439836"
      + member_id         = (known after apply)
      + membership_id     = (known after apply)
    }

  # module.identity_center.aws_identitystore_group_membership.this["ReadOnly"] will be created
  + resource "aws_identitystore_group_membership" "this" {
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9567439836"
      + member_id         = (known after apply)
      + membership_id     = (known after apply)
    }

  # module.identity_center.aws_identitystore_user.this["Admin"] will be created
  + resource "aws_identitystore_user" "this" {
      + display_name      = "Admin"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9567439836"
      + user_id           = (known after apply)
      + user_name         = "Admin"

      + emails {
          + primary = false
          + value   = (sensitive value)
        }

      + name {
          + family_name = "user"
          + given_name  = "Admin"
        }
    }

  # module.identity_center.aws_identitystore_user.this["ReadOnly"] will be created
  + resource "aws_identitystore_user" "this" {
      + display_name      = "ReadOnly"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9567439836"
      + user_id           = (known after apply)
      + user_name         = "ReadOnly"

      + emails {
          + primary = false
          + value   = (sensitive value)
        }

      + name {
          + family_name = "user"
          + given_name  = "ReadOnly"
        }
    }

  # module.identity_center.aws_ssoadmin_account_assignment.this will be created
  + resource "aws_ssoadmin_account_assignment" "this" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-775858b230c132be"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "USER"
      + target_id          = "313744126666"
      + target_type        = "AWS_ACCOUNT"
    }

  # module.identity_center.aws_ssoadmin_managed_policy_attachment.main["AdministratorAccess"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "main" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-775858b230c132be"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/AdministratorAccess"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = (known after apply)
    }

  # module.identity_center.aws_ssoadmin_managed_policy_attachment.main["ReadOnlyAccess"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "main" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-775858b230c132be"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = (known after apply)
    }

  # module.identity_center.aws_ssoadmin_permission_set.this["AdministratorAccess"] will be created
  + resource "aws_ssoadmin_permission_set" "this" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-775858b230c132be"
      + name             = "AdministratorAccess"
      + relay_state      = "https://ap-northeast-1.console.aws.amazon.com/console/home?region=ap-northeast-1"
      + session_duration = "PT8H"
      + tags_all         = {
          + "Environment"        = "mng"
          + "ManagedByTerraform" = "true"
          + "ServiceName"        = "fumis-portfolio"
        }
    }

  # module.identity_center.aws_ssoadmin_permission_set.this["ReadOnlyAccess"] will be created
  + resource "aws_ssoadmin_permission_set" "this" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-775858b230c132be"
      + name             = "ReadOnlyAccess"
      + relay_state      = "https://ap-northeast-1.console.aws.amazon.com/console/home?region=ap-northeast-1"
      + session_duration = "PT8H"
      + tags_all         = {
          + "Environment"        = "mng"
          + "ManagedByTerraform" = "true"
          + "ServiceName"        = "fumis-portfolio"
        }
    }

  # module.organizations.aws_organizations_account.accounts["dev"] will be created
  + resource "aws_organizations_account" "accounts" {
      + arn               = (known after apply)
      + close_on_deletion = false
      + create_govcloud   = false
      + email             = "381704fumi+dev@gmail.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "dev"
      + parent_id         = (known after apply)
      + role_name         = "OrganizationAccountAccessRole"
      + status            = (known after apply)
      + tags_all          = {
          + "Environment"        = "mng"
          + "ManagedByTerraform" = "true"
          + "ServiceName"        = "fumis-portfolio"
        }
    }

  # module.organizations.aws_organizations_account.accounts["prd"] will be created
  + resource "aws_organizations_account" "accounts" {
      + arn               = (known after apply)
      + close_on_deletion = false
      + create_govcloud   = false
      + email             = "381704fumi+prd@gmail.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "prd"
      + parent_id         = (known after apply)
      + role_name         = "OrganizationAccountAccessRole"
      + status            = (known after apply)
      + tags_all          = {
          + "Environment"        = "mng"
          + "ManagedByTerraform" = "true"
          + "ServiceName"        = "fumis-portfolio"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"envs-ci","PRNumber":6,"Program":"tfcmt","SHA1":"1b2be7bca349ff2f957300a52867409efffe40c6","Target":"mng","Vars":{},"WorkflowName":"Check"} -->